Chapter04-Ruby_on_Rails/odin-facebook/app/views/users/_remove_friend_request.html.erb

<%= form_for(current_user.friend_requests.find_by(friend_id: @user.id),
	           html: { method: :delete },
	           remote: true) do |f| %>
---
SELECT  "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1 AND "friend_requests"."friend_id" = $2 LIMIT $3  [["user_id", 1], ["friend_id", 4], ["LIMIT", 1]]