Chapter04-Ruby_on_Rails/odin-facebook/app/views/users/show.html.erb

	<div class="col-md-8">
		<% if @user.posts.any? %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]