Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:comment][:post_id])
		@comment = @post.comments.build(comment_params)
		if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 196], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sadasdsa"], ["user_id", 1], ["post_id", 196], ["created_at", "2018-03-20 19:08:48.885857"], ["updated_at", "2018-03-20 19:08:48.885857"]]