Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/friend_requests_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "friend_requests" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 2], ["created_at", "2018-03-14 15:06:24.926426"], ["updated_at", "2018-03-14 15:06:24.926426"]]
---
	def create
		@user = User.find(params[:friend_id])
		@friend_request = current_user.friend_requests.new(friend: @user)

		if @friend_request.save

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1  [["user_id", 1]]
---
	def index
		@incoming = FriendRequest.where(friend: current_user)

DELETE FROM "friend_requests" WHERE "friend_requests"."id" = $1  [["id", 8]]
---
	def destroy
		@user = @friend_request.friend
		@friend_request.destroy

SELECT  "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."friend_id" = $1 LIMIT $2  [["friend_id", 15], ["LIMIT", 1]]
---
		def set_friend_request
			@friend_request = FriendRequest.find(params[:id])