Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 181], ["created_at", "2018-03-19 19:56:41.221800"], ["updated_at", "2018-03-19 19:56:41.221800"]]
---
	def create
		like = Like.new(user_id: params[:user_id], post_id: params[:post_id])
		if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]
---
	def destroy
		@like = Like.find(params[:id])
		@like.destroy