Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "lallalalala"], ["user_id", 1], ["created_at", "2018-03-19 15:33:56.464669"], ["updated_at", "2018-03-19 15:33:56.464669"]]
---
	def create
		@post = current_user.posts.build(post_params)
		if @post.save