Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/static_pages_controller.rb

	def home
		if user_signed_in?
			@user = current_user
			@post = current_user.posts.build
			@feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "posts".* FROM "posts" WHERE (user_id = 1) ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (user_id IN (SELECT friend_id FROM friendships