Chapter04-Ruby_on_Rails/odin-facebook/app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@posts = @user.posts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]