Chapter04-Ruby_on_Rails/odin-facebook/app/views/posts/_post.html.erb

		Posted <%= time_ago_in_words(post.created_at) %> ago.</span>
	<% if current_user.liked_posts.include?(post) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 186], ["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 196], ["LIMIT", 1]]

	<div class="comment_list">
		<% if post.comments.size >= 1 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 196]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 51]]